import { Injectable } from '@angular/core';

@Injectable()
export class DictService {

  constructor() { }

  getNationality() {
    return [
      "Казах/Казашка", 
      "Русский/Русская",
      "Уйгур/Уйгурка"
    ];
  }

  getRegions() {
    return [
      "Астана",
      "Алматы",
      "Акмолинская область",
      "Актюбинская область",
      "Алматинская область",
      "Атырауская область",
      "Восточно-Казахстанская область",
      "Жамбылская область",
      "Западно-Казахстанская область",
      "Карагандинская область",
      "Костанайская область",
      "Кызылординская область",
      "Мангистауская область",
      "Павлодарская область",
      "Северо-Казахстанская область",
      "Южно-Казахстанская область"
    ];
  }

  getDistricts() {
    return [
      "Алатауский",
      "Алмалинский",
      "Ауэзовский",
      "Бостандыкский",
      "Медеуский",
      "Наурызбайский",
      "Турксибский",
      "Жетысуский"
    ]
  }

  getDocTypes() {
    return [
      "Паспорт",
      "Удостоверение личности"
    ]
  }

  getInsuranceCompanies() {
    return [
      "Eurasian",
      "KazKom"
    ]
  }

  getSocialStatutes() {
    return [
      "Не женат/Не замужем",
      "Состоит в браке"
    ]
  }

}
